lab01-servidor-tradicional/testes-estresse/resultados/wrk-100.txt
Running 10s test @ http://localhost:3000/api/tasks?page=1&limit=10
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.59ms   56.68ms 795.39ms   97.30%
    Req/Sec     2.24k   451.20     3.34k    90.00%
  Latency Distribution
     50%   10.52ms
     75%   11.31ms
     90%   13.23ms
     99%  355.34ms
  89164 requests in 10.03s, 87.29MB read
  Non-2xx or 3xx responses: 88169
Requests/sec:   8887.97
Transfer/sec:      8.70MB